* Как можно избежать дублирование кода в двух классах
  * наследование

* С помощью какого ключевого слова мы наследуемся
  * extends

* A extends B - где предок, где потомок?
  * B - родитель / предок
  * А - потомок

* С помощью каких модификаторов можно сделать так, чтобы поля и методы родительнского клааса
* были доступны в потомке
  * public
  * protected

* Какие элементы класса-предка копируются в классы-потомки?
  * поля
  * методы
  * конструкторы - не копируются

* Как мы можем принудительно вызвать конструктор предка в конструкторе потомка
  * super

* Что будет, если в конструкторе класса-потомка не вызвать конструктор предка?
  * Java попытается вызвать пустой конструктор предка (super())
  * Если его нет - не будет работать (ошибка компиляции - программа не запустится)